<?PHP
namespace SchematicLoader\utils;

class JEtoBE{
    public static function JEtoBE($id,$data){
        
    }

    public static $list =[
        [
            "ID_JE" => 3,//ポドゾル
            "Da_JE" => 2,
            "ID_BE" => 243,
            "Da_BE" => 0
        ],
        [
            "ID_JE" => 36,//ピストンで動かされたブロック(?)
            "ID_BE" => -1
        ],
        [
            "ID_JE" => 95,//色付きガラス
            "ID_BE" => 241
        ],
        [
            "ID_JE" => 125,//重ねた木材ハーフブロック
            "ID_BE" => 157
        ],
        [
            "ID_JE" => 126,//ハーフブロック
            "ID_BE" => 158
        ],
        [
            "ID_JE" => 157,//アクティベートレール
            "ID_BE" => 126
        ],
        [
            "ID_JE" => 158,//ドロッパ―
            "ID_BE" => 125
        ],
        [
            "ID_JE" => 166,//バリアブロック(未)
            "ID_BE" => -1
        ],
        [
            "ID_JE" => 188,//マツのフェンス
            "ID_BE" => 183
        ],
        [
            "ID_JE" => 189,//シラカバのフェンス
            "ID_BE" => 184
        ],
        [
            "ID_JE" => 190,//ジャングルのフェンス
            "ID_BE" => 185
        ],
        [
            "ID_JE" => 191,//ダークフェンスのフェンス
            "ID_BE" => 186
        ],
        [
            "ID_JE" => 192,//アカシアのフェンス
            "ID_BE" => 187
        ],
        [
            "ID_JE" => 198,//エンドロッド
            "ID_BE" => 208
        ],
        [
            "ID_JE" => 199,//コーラスプラント
            "ID_BE" => 240
        ],
        [
            "ID_JE" => 207,//ビートルート
            "ID_BE" => 244
        ],
        [
            "ID_JE" => 208,//道ブロック
            "ID_BE" => 198
        ],
        [
            "ID_JE" => 210,//リピートコマンドブロック
            "ID_BE" => 188
        ],
        [
            "ID_JE" => 211,//チェーンコマンドブロック
            "ID_BE" => 189
        ],
        [
            "ID_JE" => 212,//薄氷
            "ID_BE" => 207
        ],
        [
            "ID_JE" => 217,//ストラクチャーヴォイド(未)
            "ID_BE" => -1
        ],
        [
            "ID_JE" => 218,//オブザーバー
            "ID_BE" => 251
        ],
        [
            "ID_JE" => 219,//シュルカーボックス
            "ID_BE" => -1
        ],
        [
            "ID_JE" => 220,//シュルカーボックス
            "ID_BE" => 0
        ],
        [
            "ID_JE" => 221,//シュルカーボックス
            "ID_BE" => 0
        ],
        [
            "ID_JE" => 222,//シュルカーボックス
            "ID_BE" => 0
        ],
        [
            "ID_JE" => 223,//シュルカーボックス
            "ID_BE" => 0
        ],
        [
            "ID_JE" => 224,//シュルカーボックス
            "ID_BE" => 0
        ],
        [
            "ID_JE" => 225,//シュルカーボックス
            "ID_BE" => 0
        ],
        [
            "ID_JE" => 226,//シュルカーボックス
            "ID_BE" => 0
        ],
        [
            "ID_JE" => 227,//シュルカーボックス
            "ID_BE" => 0
        ],
        [
            "ID_JE" => 228,//シュルカーボックス
            "ID_BE" => 0
        ],
        [
            "ID_JE" => 229,//シュルカーボックス
            "ID_BE" => 0
        ],
        [
            "ID_JE" => 230,//シュルカーボックス
            "ID_BE" => 0
        ],
        [
            "ID_JE" => 231,//シュルカーボックス
            "ID_BE" => 0
        ],
        [
            "ID_JE" => 233,//シュルカーボックス
            "ID_BE" => 0
        ],
        [
            "ID_JE" => 234,//シュルカーボックス
            "ID_BE" => 0
        ],
        [
            "ID_JE" => 235,//シュルカーボックス
            "ID_BE" => 0
        ],
        [
            "ID_JE" => 236,//シュルカーボックス
            "ID_BE" => 0
        ],
        [
            "ID_JE" => 237,//シュルカーボックス
            "ID_BE" => 0
        ],
        [
            "ID_JE" => 233,//シュルカーボックス
            "ID_BE" => 0
        ],
        [
            "ID_JE" => 234,//シュルカーボックス
            "ID_BE" => 0
        ],
        [
            "ID_JE" => 235,//テラコッタブロック
            "ID_BE" => 220
        ],
        [
            "ID_JE" => 236,//テラコッタブロック
            "ID_BE" => 221
        ],
        [
            "ID_JE" => 237,//テラコッタブロック
            "ID_BE" => 222
        ],
        [
            "ID_JE" => 238,//テラコッタブロック
            "ID_BE" => 223
        ],
        [
            "ID_JE" => 239,//テラコッタブロック
            "ID_BE" => 224
        ],
        [
            "ID_JE" => 240,//テラコッタブロック
            "ID_BE" => 225
        ],
        [
            "ID_JE" => 241,//テラコッタブロック
            "ID_BE" => 226
        ],
        [
            "ID_JE" => 242,//テラコッタブロック
            "ID_BE" => 227
        ],
        [
            "ID_JE" => 243,//テラコッタブロック
            "ID_BE" => 228
        ],
        [
            "ID_JE" => 244,//テラコッタブロック
            "ID_BE" => 229
        ],
        [
            "ID_JE" => 245,//テラコッタブロック
            "ID_BE" => 219
        ],
        [
            "ID_JE" => 246,//テラコッタブロック
            "ID_BE" => 231
        ],
        [
            "ID_JE" => 247,//テラコッタブロック
            "ID_BE" => 232
        ],
        [
            "ID_JE" => 248,//テラコッタブロック
            "ID_BE" => 233
        ],
        [
            "ID_JE" => 249,//テラコッタブロック
            "ID_BE" => 234
        ],
        [
            "ID_JE" => 250,//テラコッタブロック
            "ID_BE" => 235
        ],
        [
            "ID_JE" => 251,//コンクリート
            "ID_BE" => 236
        ],
        [
            "ID_JE" => 252,//コンクリートパウダー
            "ID_BE" => 237
        ],
        [
            "ID_JE" => 255,//ストラクチャーブロック
            "ID_BE" => 252
        ],
        [
            "ID_JE" => -1,//コンクリートパウダー
            "ID_BE" => 245
        ]
    ];
    
    
}
?>